#include "tasks.h"

/*	Task 03. The Greatest Common Divisor II [наибольший общий делитель, НОД]
*
*	Даны три натуральных числа. Необходимо найти наибольший общий делитель данных чисел.
*	Если данные введены некорректно, т.е. меньше единицы, то должен быть возвращён ноль.
*
*	Примечание
*	1)	Наибольшим общим делителем чисел 21, 28 и 63 называется наибольшее число,
*		на которое 21, 28 и 63 делятся без остатка. Следовательно, это число 7.
*	2)	Для реализации эффективного алгоритма рекомендуется использовать
*		алгоритм Евклида для нахождения наибольшего общего делителя.
*
*	Формат входных данных [input]
*	На вход подаётся три натуральных числа в диапазоне типа int.
*
*	Формат выходных данных [output]
*	Должно возвращаться целое число, которое является решением задания.
*
*	[ input 1]: 21 28 63
*	[output 1]: 7
*
*	[ input 2]: 18 12 24
*	[output 2]: 6
*
*	[ input 3]: 24 48 36
*	[output 3]: 12
*
*	[ input 4]: 5 13 3
*	[output 4]: 1
*
*	[ input 5]: 1 1 1
*	[output 5]: 1
*
*	[ input 6]: -1 1 1
*	[output 6]: 0
*/

//task03