#include "tasks.h"

/*	Task 01. The Greatest Natural Divisor [наибольший натуральный делитель]
*
*	Дано целое число. Необходимо найти его наибольший натуральный делитель, отличный от самого этого числа.
*	Если данные введены некорректно, т.е. меньше двойки, то должен быть возвращён ноль.
*
*	Примечание
*	Для нахожиения наибольшего натурального делителя постарайтесь использовать эффективный алгоритм.
* 
*	Формат входных данных [input]
*	На вход подаётся целое число в диапазоне типа int.
*
*	Формат выходных данных [output]
*	Должно возвращаться целое число, которое является решением задания.
*
*	[ input 1]: 15
*	[output 1]: 5
*
*	[ input 2]: 49
*	[output 2]: 7
*
*	[ input 3]: 30
*	[output 3]: 15
*
*	[ input 4]: 1
*	[output 4]: 0
*
*	[ input 5]: -15
*	[output 5]: 0
*/

//task01